---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchConnectorDistSysToCircuit
source: html/c967c7ac-0a2f-0a67-9225-bf368ca2ae32.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MismatchConnectorDistSysToCircuit Property

Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchConnectorDistSysToCircuit { get; }
```